%% Последовательность прямоугольных импульсов

N = 16;                                     % Число ненулевых гармоник 
t = -3:0.01:3;                              % Вектор моментов времени
A = 4;                                      % Амплитуда 
T = 4;                                      % Период 
q = T/3;                                    % Cкважность, Q = T/t
nh = (1:N);                                 % Номера ненулевых гармоник 
harmonics = sin((pi*nh)'./q) .* cos((2*pi*nh)'*t/T);
Am = 2*A/pi./nh;                            % Амплитуды гармоник 
s = A/q + harmonics .* repmat(Am', 1, length(t));    
                                            % Строки - частичные суммы гармоник
s = cumsum(s); 
for k=1:N 
    subplot(8, 2, k);
    plot(t, s(k,:));
end

%% Меандр

N = 16;                                     % Число ненулевых гармоник 
t = -3:0.01:3;                              % Вектор моментов времени
A = 4;                                      % Амплитуда 
T = 4;                                      % Период 
nh = (1:N)*2-1;                             % Номера ненулевых гармоник 
harmonics = cos((2*pi*nh)'*t/T);            
Am = 2*A/pi./nh;                            % Амплитуды гармоник 
Am(2:2:end) = -Am(2:2:end);                 % Чередование знаков 
s = A/2 + harmonics .* repmat(Am', 1, length(t)); 
                                            % Строки - частичные суммы гармоник
s = cumsum(s); 
for k=1:N 
    subplot(8, 2, k);
    plot(t, s(k,:));
end

%% Пилообразный сигнал

N = 16;                                     % Число ненулевых гармоник 
t = -3:0.01:3;                              % Вектор моментов времени
A = 4;                                      % Амплитуда 
T = 4;                                      % Период 
nh = (1:N);                                 % Номера ненулевых гармоник 
harmonics = sin((2*pi*nh)'*t/T);            %
Am = 2*A/pi./nh;                            % Амплитуды гармоник 
Am(2:2:end) = -Am(2:2:end);                 % Чередование знаков 
s = harmonics .* repmat(Am', 1, length(t)); % Строки - частичные суммы гармоник
s = cumsum(s); 
for k=1:N 
    subplot(8, 2, k);
    plot(t, s(k,:));
end

%% Последовательность треугольных импульсов

N = 16;                                     % Число ненулевых гармоник 
t = -3:0.01:3;                          % Вектор моментов времени
A = 4;                                      % Амплитуда 
T = 4;                                      % Период 
nh =(1:N) * 2-1;                            % Номера ненулевых гармоник 
harmonics = cos((2*pi*nh)'*t/T);            %
Am = 8*A /(pi*pi)./(nh.^2);                 % Амплитуды гармоник 
s = harmonics .* repmat(Am', 1, length(t)); % Строки - частичные суммы гармоник
s = cumsum(s); 
for k=1:N 
    subplot(8, 2, k);
    plot(t, s(k,:));
end
